src/cf/InformationRegisters/инт_УдаленнаяСтатистикаОбработкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_УдаленнаяСтатистикаОбработкиСообщений</Name>
			<Comment>Накопленное число записей статистики обработки сообщений, удалённых при очистке устаревших данных</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоУдаленных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыОперацийСтатистики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Успешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_УдаленнаяСтатистикаОбработкиСообщений/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Прибавляет удалённые записи статистики обработки сообщений к накопленным итогам
// в разрезе потока данных, типа операции и результата.
// Вызывается в транзакции удаления порции устаревшей статистики: сумма числа записей
// регистра статистики и накопленного числа удалённых записей образует значение метрики
// pde_messages_processed_total и обязана оставаться неизменной при очистке.
//
// Параметры:
//  УдаленныеЗаписи - ТаблицаЗначений - Удалённые записи статистики:
//    * ПотокДанных - СправочникСсылка.инт_ПотокиДанных - Поток данных сообщения.
//    * ТипОперации - ПеречислениеСсылка.инт_ТипыОперацийСтатистики - Тип выполненной операции.
//    * Успешно     - Булево - Признак успешного завершения операции.
//
Процедура УчестьУдаленныеЗаписи(УдаленныеЗаписи) Экспорт
	
	Итоги = КоличествоПоСочетаниямИзмерений(УдаленныеЗаписи);
	Если Итоги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаблокироватьИтоги(Итоги);
	
	Для Каждого Итог Из Итоги Цикл
		МенеджерЗаписи = РегистрыСведений.инт_УдаленнаяСтатистикаОбработкиСообщений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Итог);
		МенеджерЗаписи.Прочитать();
		НакопленоРанее = ?(МенеджерЗаписи.Выбран(), МенеджерЗаписи.КоличествоУдаленных, 0);
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Итог);
		МенеджерЗаписи.КоличествоУдаленных = НакопленоРанее + Итог.Количество;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КоличествоПоСочетаниямИзмерений(УдаленныеЗаписи)
	
	Измерения = "ПотокДанных, ТипОперации, Успешно";
	КолонкаКоличества = "Количество";
	
	Итоги = УдаленныеЗаписи.Скопировать(, Измерения);
	Итоги.Колонки.Добавить(КолонкаКоличества, Новый ОписаниеТипов("Число"));
	Итоги.ЗаполнитьЗначения(1, КолонкаКоличества);
	Итоги.Свернуть(Измерения, КолонкаКоличества);
	
	Возврат Итоги;
	
КонецФункции

// Запрещает параллельное изменение накопленных итогов: значение читается и записывается
// в одной транзакции, поэтому без блокировки прибавление соседнего сеанса будет потеряно.
//
// Параметры:
//  Итоги - ТаблицаЗначений - Прибавляемые количества в разрезе измерений регистра.
//
Процедура ЗаблокироватьИтоги(Итоги)
	
	ИмяРегистра = Метаданные.РегистрыСведений.инт_УдаленнаяСтатистикаОбработкиСообщений.ПолноеИмя();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(ИмяРегистра);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Итоги;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПотокДанных", "ПотокДанных");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТипОперации", "ТипОперации");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Успешно", "Успешно");
	Блокировка.Заблокировать();
	
КонецПроцедуры

#КонецОбласти
